<?php
require('./fpdf/alphapdf.php');
require("../config/main_function.php");
$connect_db = connectDB("LM=VjfQ{6rsm&/h`");

$form_id = $_GET['id'];

//$pdf->Line(145, 25, 190, 25); //โค้ดเส้นบรรทัด
//$pdf->Image('check_mark.png', 27.5, 131.5, 5, 5, 'PNG');//ติ๊กถูก -3.3 จากตัวหนังสือ
//$pdf->Image('circle_mark.png', 64, 76, 8, 6, 'PNG');//วงกลม -2.3 จากตัวหนังสือ (สั้น 8 ยาว 14)
//$pdf->Image('wing_mark.png', 50, 71, 5, 7, 'PNG');//สี่เหลี่ยมด้านมน -3.3 จากตัวหนังสือ
//$pdf->Image('scissors_mark.png', 50, 71, 5, 7, 'PNG');//กรรไกร


$pdf = new FPDF();
$pdf->AliasNbPages();

$pdf->SetAutoPageBreak(false);
$pdf->AddFont('THSarabunNew', '', 'THSarabunNew.php');
$pdf->AddFont('THSarabunNew Bold', '', 'THSarabunNew Bold.php');
$pdf->AddFont('THSarabunNew BoldItalic', '', 'THSarabunNew BoldItalic.php');

$pdf->AddPage();
$pdf->Image('print_peaberey_pm.jpg', 0, 0, 210, 297, 'JPG'); //print_peaberey_pm

//-----------------------------------------หัวกระดาษ------------------------------------
$pdf->SetTextColor(0, 0, 0);
$pdf->SetFont('THSarabunNew Bold', '', 14);
$pdf->SetXY(0, 18); //เวลาแจ้งงาน
$pdf->MultiCell(66, 0, iconv('UTF-8', 'cp874', "19.50"), 0, 'C', 0);
$pdf->SetXY(0, 25.5); //เวลาปิดงาน
$pdf->MultiCell(66, 0, iconv('UTF-8', 'cp874', "19.50"), 0, 'C', 0);

//----------------------------------------------หัวตาราง ตาราง------------------------------------------

///------------------------------total----------------------------
$pdf->SetFont('THSarabunNew', '', 14);
$vv = 132;
$pdf->SetXY($vv, 73.5); //รวมเป็นเงิน
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "รวมเป็นเงิน"), 0, 'L', 0);
$pdf->SetXY($vv, 79); //หักส่วนลด
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "หักส่วนลด"), 0, 'L', 0);
$pdf->SetXY($vv, 84.5); //หักเงินมัดจำ
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "หักเงินมัดจำ"), 0, 'L', 0);
$pdf->SetXY($vv, 90); //จำนวนเงินรวมทั้งสิ้น
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "จำนวนเงินรวมทั้งสิ้น"), 0, 'L', 0);

$pdf->SetXY(0, 73.5); //รวมเป็นเงิน
$pdf->MultiCell(202.8, 0, iconv('UTF-8', 'cp874', "1,300.00"), 0, 'R', 0);
$pdf->SetXY(0, 79); //หักส่วนลด
$pdf->MultiCell(202.8, 0, iconv('UTF-8', 'cp874', "1,300.00"), 0, 'R', 0);
$pdf->SetXY(0, 84.5); //หักเงินมัดจำ
$pdf->MultiCell(202.8, 0, iconv('UTF-8', 'cp874', "1,300.00"), 0, 'R', 0);
$pdf->SetXY(0, 90); //จำนวนเงินรวมทั้งสิ้น
$pdf->MultiCell(202.8, 0, iconv('UTF-8', 'cp874', "1,300.00"), 0, 'R', 0);



$pdf->SetXY(7, 90); //จำนวนรวมถ้วน
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "(หนึ่งพันสามร้อยบาทถ้วน)." . ""), 0, 'L', 0);






$pdf->SetXY(7, 50); //
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "" . ""), 0, 'L', 0);

//--------------------------------------------เงื่อนไข-------------------------------------------------------------------------------------------------------------------------------------
$pdf->SetFont('THSarabunNew Bold', '', 14);
$pdf->SetXY(13, 107); //เงื่อนไข :
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "เงื่อนไขการรับประกันสินค้า นับตั้งแต่วันที่ติดตั้ง :"), 0, 'L', 0);
$pdf->Line(13, 109.5, 80, 109.5);
$pdf->SetFont('THSarabunNew', '', 13);
$pdf->SetXY(7, 112.5); //1
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-   " . "ชุดแต่งรอบคัน,spoiler ซึ่งประกอบไปด้วยชิ้นงาน ABS,สีเคลือบ,ตะแกง,ตัวยึดต่างๆ"), 0, 'L', 0);
$pdf->SetXY(7, 118); //2
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-   " . "อุปกรณ์เกี่ยวข้องกับระบบไฟ เช่น Daylight,ไฟ LED,กล้อง,จอภาพ,ชุดเซ็นเซอร์"), 0, 'L', 0);
$pdf->SetXY(7, 123.5); //3
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-   " . "กล้องบันทึกรุ่นC509และT6665,memory card"), 0, 'L', 0);
$pdf->SetXY(7, 129); //4
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-   " . "อุปกรณ์ที่ผลิตจากพลาสติกและผ่านกระบวนการเคลือบหรือทำสี"), 0, 'L', 0);
$pdf->SetXY(7, 134.5); //5
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-   " . "ชิ้นส่วนที่เป็นไฟเบอร์กลาส,ยางประเภทต่างๆ,อุปกรณ์ที่ติดตั้งด้วยเทปกาว3M"), 0, 'L', 0);
$pdf->SetXY(7, 139.5); //6
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-   " . "อุปกรณ์ที่มีลักษณะเป็นหลอดหรือแผงที่ให้แสงสว่าง"), 0, 'L', 0);
$pdf->SetXY(7, 145); //7
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-   " . "ผ้าคลุมรถ : รับประกัน1ปีเฉพาะผ้าดูป๊อง/ผ้าชนิดอื่นๆจะเปลี่ยนได้เฉพาะกรณีตะเข็บขาดหรือตะเข็บรุ่ยเท่านั้น"), 0, 'L', 0);

//---------------------------------------เวลาของแต่ละเงื่อนไข
$pdf->SetXY(178, 112.5); //1
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "1" . "  ปี"), 0, 'L', 0);
$pdf->SetXY(178, 118); //2
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "6" . "  เดือน"), 0, 'L', 0);
$pdf->SetXY(178, 123.5); //3
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "3" . "  เดือน"), 0, 'L', 0);
$pdf->SetXY(178, 129); //4
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "3" . "  เดือน"), 0, 'L', 0);
$pdf->SetXY(178, 134.5); //5
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "3" . "  เดือน"), 0, 'L', 0);
$pdf->SetXY(178, 140); //6
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "1" . "  เดือน"), 0, 'L', 0);


//--------------------------------------------ข้อยกเว้น-------------------------------------------------------------------------------------------------------------------------------------
$pdf->SetFont('THSarabunNew Bold', '', 14);
$pdf->SetXY(13, 156); //ข้อยกเว้น :
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "ข้อยกเว้นการรับประกันสินค้า :"), 0, 'L', 0);
$pdf->Line(13, 158.5, 58, 158.5);
$pdf->SetFont('THSarabunNew', '', 13);
$pdf->SetXY(7, 161.5); //1
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "การใช้น้ำยาขัดเคลือบสีหรือน้ำยาชนิดอื่นๆนอกเหนือจากการล้างตามปกติกับสินค้าที่ผลิตจากอะคริลิค เช่น คิ้วกันสาดประตู"), 0, 'L', 0);
$pdf->SetXY(7, 167); //2
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "สินค้าสูญหายไปจากจุดที่ติดตั้ง (ไม่ว่าการหายไปของสินค้านั้นจะเกิดมาจากสาเหตุใดก็ตามให้ถือว่าการรับประกันได้สิ้นสุดลง)"), 0, 'L', 0);
$pdf->SetXY(7, 172.5); //3
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "สีไม่ตรง/มีรอยขีดขวน/มีการแตกหักของอุปกรณ์และตัวรถ ซึ่งไม่ได้แจ้งเหตุในวันที่ติดตั้ง"), 0, 'L', 0);
$pdf->SetXY(7, 178); //4
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "ความเสียหายอันเนื่องมาจากอุบัติเหตุในกรณี เช่น ชน,ครูด,กระแทก,หินกระเด็น,ภัยธรรมชาติต่างๆ เช่น น้ำท่วม"), 0, 'L', 0);
$pdf->SetXY(7, 183.5); //5
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "งานที่เป็นโครเมี่ยมและอลูมิเนียมทุกประเภท ซึ่งเกิดคราบ,ด่าง,สนิมไเด้เองตามธรรมชาติ"), 0, 'L', 0);
$pdf->SetXY(7, 189); //6
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "ความไม่พอดี, ไม่เข้ารูป หรือความบกพร่องอื่นๆของชิ้นงาน ซึ่งเกิดจากโรงงานผู้ผลิตชิ้นงานนั้นๆ"), 0, 'L', 0);
$pdf->SetXY(7, 194.5); //7
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "การล้าง,อัดฉีด,ขัดสี,ด้วยน้ำยาต่างๆซึ่งมีผลทำให้สินค้าเสียหาย,อ้า,หลุด,เป็นคราบด่าง ฯลฯ"), 0, 'L', 0);
$pdf->SetXY(7, 200); //8
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "การดัดแปลง,แก้ไข,ต่อเติม,ต่อพ่วง,ถอด,รื้อ,ขยับ,เคลื่อนย้ายอุปกรณ์ต่างๆเอง หลังจากที่เจ้าหน้าที่ของบริษัทได้ติดตั้งอุปกรณ์ไปแล้ว"), 0, 'L', 0);
$pdf->SetXY(7, 205.5); //9
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "การติดตั้ง, การนำใช้งานผิดประเภท โดยไม่ผ่านการรับรองโดยเจ้าหน้าที่เทคนิคของทางบริษัท"), 0, 'L', 0);
$pdf->SetXY(7, 211); //10
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "ความเสียหายอันเกิดจากการใช้งานไม่ถูกวิธีหรือเกินขีดจำกัดของอุปกรณ์นั้นๆ"), 0, 'L', 0);
$pdf->SetXY(7, 216.5); //11
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "การซื้อสินค้าไปโดยที่ไม่ได้รับการติดตั้งจากฝ่ายเทคนิคของบริษัทฯ"), 0, 'L', 0);
$pdf->SetXY(7, 221.5); //12
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "สินค้าที่ลดราคาพิเศษ/สินค้าที่เข้าร่วมโปรโมชั่นclearance/สินค้าที่ได้แจ้งเงื่อนไขพิเศษในวันที่สั่งซื้อ"), 0, 'L', 0);
$pdf->SetXY(7, 227); //13
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "สินค้าที่ทางบริษัทฯยังไม่ได้รับเงินครบถ้วนสมบูรณ์ตามจำนวนที่เรียกเก็บ"), 0, 'L', 0);
$pdf->SetXY(7, 232.5); //14
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "-" . "การไม่แจ้งเลขใบรับประกัน, รายละเอียดรถ หรือหลักฐานการซื้อสินค้าอื่นๆ เพื่อให้ทางบริษัทฯสามารถค้นหาข้อมูลได้"), 0, 'L', 0);


//--------------------------------------------หมายเหตุ-------------------------------------------------------------------------------------------------------------------------------------
$pdf->SetFont('THSarabunNew Bold', '', 14);
$pdf->SetXY(13, 244.5); //หมายเหตุ
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "หมายเหตุ :"), 0, 'L', 0);
$pdf->SetFont('THSarabunNew', '', 13);
$pdf->SetXY(7, 250); //1
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "1." . "สินค้าตามรายการข้างต้นยังคงเป็นกรรมสิทธิ์เป็นทรัพย์สินของทางบริษัทไปจนกว่าจะได้รับค่าสินค้าอย่างครบถ้วนสมบูรณ์"), 0, 'L', 0);
$pdf->SetXY(7, 255.5); //2
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "2." . "บริษัทจะทำการเรียกคืน หรือถอดคืนสินค้าที่ยังไม่ได้รับเงินได้ตลอดเวลา โดยที่ผู้สั่งซื้อไม่สามารถปฏิเสธ บ่ายเบี่ยง เพิกเฉย และไม่สามารถเอาความ"), 0, 'L', 0);
$pdf->SetXY(10, 261); //2ต่อ
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "" . "กับทางบริษัทซึ่งเป็นเจ้าของทรัพย์สินดังกล่าวได้"), 0, 'L', 0);
$pdf->SetXY(7, 266.5); //3
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "3." . "ไม่รับคืนสินค้าในทุกกรณี และจะคิดค่าบริการเพิ่มเติมสำหรับการถอด หรือย้ายตำแหน่งที่ติดตั้ง"), 0, 'L', 0);
$pdf->SetXY(7, 272); //4
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "4." . "เพื่อประโยชน์ของท่าน กรุณาสอบถามรายละเอียด และข้อยกเว้นการรับประกันสินค้ากับทางฝ่ายขายค่ะ"), 0, 'L', 0);

$pdf->SetFont('THSarabunNew Bold', '', 18);
$pdf->Line(5, 278, 205, 278); //ขีดเสร้ท้ายกรัดาศ
$pdf->SetXY(5, 283.5); //
$pdf->MultiCell(0, 0, iconv('UTF-8', 'cp874', "Arkira Auto Co.,Ltd" . "  เบอร์โทร : " . "0994909669/0942614193/0894461939" . "    Line Official ID:  " . "@arkira"), 0, 'L', 0);













$pdf->Output();
